
/**
 * 共通アクセス領域（パブリック変数の宣言用途）
 */
class ShareSpace{
    
    //=======================
    // DOM
    //=======================
    // エクスプローラー
    static explorer;
    // ファイルコンテナ
    static noteContainer;
    // 設定コンテナ
    static settingContainer;

    //=======================
    // クラス
    //=======================
    // ロケーションマネージャー
    static LM;   

    //=======================
    // 関数
    //=======================
    // ロケーション移動ボタン使用可否
    static setLocationButtonStyle;
}